In [9]:
#import pandas as pd
import pandas.io.data as web
all_data = {}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker,'1/1/2000','1/1/2010')
price = pd.DataFrame({tic:data['Adj Close']
                      for tic,data in all_data.iteritems()})
volume = pd.DataFrame({tic:data['Volume']
                       for tic,data in all_data.iteritems()})
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [10]:
returns.MSFT.corr(returns.IBM)

0.49597968454928998

In [11]:
returns.MSFT.cov(returns.IBM)

0.00021595764843398315

In [12]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.410011  0.424305
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.410011  0.390689  1.000000  0.495980
MSFT  0.424305  0.443587  0.495980  1.000000

In [13]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.001027  0.000303  0.000252  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000252  0.000142  0.000367  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516

In [14]:
returns.corrwith(returns.IBM)

AAPL    0.410011
GOOG    0.390689
IBM     1.000000
MSFT    0.495980
dtype: float64

In [15]:
returns.corrwith(volume)

AAPL   -0.057549
GOOG    0.062647
IBM    -0.007892
MSFT   -0.014245
dtype: float64

In [19]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [20]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [21]:
pd.value_counts(obj.values,sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [22]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [23]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [25]:
data = pd.DataFrame({'Qu1':[1,3,4,3,4],
                 'Qu2':[2,3,1,2,3],
                 'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [27]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [28]:
#以下为缺失数据处理

In [31]:
import numpy as np
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [32]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [33]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [35]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [36]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [37]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                    [NA,NA,NA],[NA,6.5,3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [38]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [39]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [40]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [41]:
data.dropna(axis=1,how='all')
df = pd.DataFrame(np.random.randn(7,3))
df.ix[:4,1] = NA;df.ix[:2,2] = NA
df

          0         1         2
0 -1.237789       NaN       NaN
1  0.445168       NaN       NaN
2 -3.120686       NaN       NaN
3  1.275838       NaN -0.327587
4  0.849291       NaN  1.693841
5  0.211109 -0.234384 -0.556223
6  0.240878 -0.988328 -1.692881

In [42]:
df.dropna(thresh=3)

          0         1         2
5  0.211109 -0.234384 -0.556223
6  0.240878 -0.988328 -1.692881

In [43]:
df.fillna(0)

          0         1         2
0 -1.237789  0.000000  0.000000
1  0.445168  0.000000  0.000000
2 -3.120686  0.000000  0.000000
3  1.275838  0.000000 -0.327587
4  0.849291  0.000000  1.693841
5  0.211109 -0.234384 -0.556223
6  0.240878 -0.988328 -1.692881

In [45]:
df.fillna({1:0.5,3:-1})

          0         1         2
0 -1.237789  0.500000       NaN
1  0.445168  0.500000       NaN
2 -3.120686  0.500000       NaN
3  1.275838  0.500000 -0.327587
4  0.849291  0.500000  1.693841
5  0.211109 -0.234384 -0.556223
6  0.240878 -0.988328 -1.692881

In [46]:
_=df.fillna(0,inplace=True)
df

          0         1         2
0 -1.237789  0.000000  0.000000
1  0.445168  0.000000  0.000000
2 -3.120686  0.000000  0.000000
3  1.275838  0.000000 -0.327587
4  0.849291  0.000000  1.693841
5  0.211109 -0.234384 -0.556223
6  0.240878 -0.988328 -1.692881

In [48]:
df= pd.DataFrame(np.random.randn(6,3))
df.ix[2:,1] = NA;df.ix[4:,2] = NA
df

          0        1         2
0  0.330818  1.47533 -0.671802
1 -0.922693 -0.88570  0.029129
2 -0.813792      NaN -0.633772
3  0.332118      NaN  2.290418
4 -1.107932      NaN       NaN
5  0.357976      NaN       NaN

In [49]:
df.fillna(method='ffill')

          0        1         2
0  0.330818  1.47533 -0.671802
1 -0.922693 -0.88570  0.029129
2 -0.813792 -0.88570 -0.633772
3  0.332118 -0.88570  2.290418
4 -1.107932 -0.88570  2.290418
5  0.357976 -0.88570  2.290418

In [50]:
df.fillna(method='ffill',limit=2)

          0        1         2
0  0.330818  1.47533 -0.671802
1 -0.922693 -0.88570  0.029129
2 -0.813792 -0.88570 -0.633772
3  0.332118 -0.88570  2.290418
4 -1.107932      NaN  2.290418
5  0.357976      NaN  2.290418

In [52]:
data = pd.Series([1.,NA,3,5,NA,7])
data.fillna(data.mean())

0    1.0
1    4.0
2    3.0
3    5.0
4    4.0
5    7.0
dtype: float64

In [54]:
data = pd.Series(np.random.randn(10),
             index = [['a','a','a','b','b','b','c','c','d','d'],
                     [1,2,3,1,2,3,1,2,2,3]])
data

a  1    1.710582
   2    0.187492
   3   -2.299756
b  1   -0.447788
   2    0.842966
   3   -0.093472
c  1    0.204901
   2    0.622350
d  2   -2.449830
   3    0.930112
dtype: float64

In [55]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [56]:
data['b']

1   -0.447788
2    0.842966
3   -0.093472
dtype: float64

In [57]:
data['b':'c']

b  1   -0.447788
   2    0.842966
   3   -0.093472
c  1    0.204901
   2    0.622350
dtype: float64

In [58]:
data.ix[['b','d']]

b  1   -0.447788
   2    0.842966
   3   -0.093472
d  2   -2.449830
   3    0.930112
dtype: float64

In [59]:
data[:,2]

a    0.187492
b    0.842966
c    0.622350
d   -2.449830
dtype: float64

In [60]:
data.unstack()

          1         2         3
a  1.710582  0.187492 -2.299756
b -0.447788  0.842966 -0.093472
c  0.204901  0.622350       NaN
d       NaN -2.449830  0.930112

In [61]:
data.unstack().stack()

a  1    1.710582
   2    0.187492
   3   -2.299756
b  1   -0.447788
   2    0.842966
   3   -0.093472
c  1    0.204901
   2    0.622350
d  2   -2.449830
   3    0.930112
dtype: float64

In [63]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                 index = [['a','a','b','b'],[1,2,1,2]],
                 columns=[['0hio','0hio','Colorado'],
                         ['Freen','Red','Green']])
frame

     0hio     Colorado
    Freen Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [64]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']
frame

state      0hio     Colorado
color     Freen Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [65]:
frame['0hio']

color      Freen  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [67]:
pd.MultiIndex.from_arrays([['0hio','0hio','Colorado'],['Green','Red','Green']],
                      names = ['state','color'])

MultiIndex(levels=[[u'0hio', u'Colorado'], [u'Green', u'Red']],
           labels=[[0, 0, 1], [0, 1, 0]],
           names=[u'state', u'color'])

In [68]:
#重排分级顺序

In [69]:
frame.swaplevel('key1','key2')

state      0hio     Colorado
color     Freen Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [70]:
frame.sortlevel(1)

state      0hio     Colorado
color     Freen Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [73]:
frame.swaplevel(0,1).sortlevel(0)

state      0hio     Colorado
color     Freen Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [75]:
frame.sum(level='key2')

state  0hio     Colorado
color Freen Red    Green
key2
1         6   8       10
2        12  14       16

In [78]:
frame.sum(level='color',axis=1)

color      Freen  Green  Red
key1 key2
a    1         0      2    1
     2         3      5    4
b    1         6      8    7
     2         9     11   10

In [79]:
#使用DataFrame的列

In [81]:
frame = pd.DataFrame({'a':range(7),'b':range(7,0,-1),
                  'c':['one','one','one','two','two','two','two'],
                  'd':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [83]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [84]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [85]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [89]:
##其他有关pandas的话题
#整数索引

In [91]:
ser = pd.Series(np.arange(3.))
#ser[-1]
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [93]:
ser2 = pd.Series(np.arange(3.),index=['a','b','c'])
ser2[-1]

2.0

In [97]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [99]:
ser3 = pd.Series(range(3),index=[-5,1,3])
ser3.iget_value(2)

c:\python27\lib\site-packages\ipykernel\__main__.py:2: FutureWarning: iget_value(i) is deprecated. Please use .iloc[i] or .iat[i]
  from ipykernel import kernelapp as app

2

In [102]:
frame = pd.DataFrame(np.arange(6).reshape(3,2),index=[2,0,1])
frame.irow(0)

c:\python27\lib\site-packages\ipykernel\__main__.py:2: FutureWarning: irow(i) is deprecated. Please use .iloc[i]
  from ipykernel import kernelapp as app

0    0
1    1
Name: 2, dtype: int32

In [103]:
#面板数据

In [104]:
import pandas.io.data as web
pdata = pd.Panel(dict((stk,web.get_data_yahoo(stk,'1/1/2009','6/1/2012'))
                     for stk in ['AAPL','GOOG','MSFT','DELL']))
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 868 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: Open to Adj Close

In [105]:
pdata = pdata.swapaxes('items','minor')
pdata['Adj Close']

                 AAPL      DELL        GOOG       MSFT
Date
2009-01-02  11.933430  10.39902  160.499779  16.716321
2009-01-05  12.437067  10.26359  163.861421  16.872549
2009-01-06  12.231930  10.68922  166.863420  17.069888
2009-01-07  11.967619  10.78596  160.844427  16.042077
2009-01-08  12.189851  10.90204  162.432840  16.543649
2009-01-09  11.911075  10.75694  157.377899  16.050300
2009-01-12  11.658599  10.30228  156.189080  16.009186
2009-01-13  11.533676  10.40869  157.003261  16.296974
2009-01-14  11.220711   9.97338  150.334921  15.696732
2009-01-15  10.964291  10.19587  149.345914  15.820069
2009-01-16  10.826218   9.93469  149.685575  16.206526
2009-01-20  10.283132   9.52840  141.234014  15.195160
2009-01-21  10.891967   9.86697  151.388865  15.935184
2009-01-22  11.619150   9.65416  153.097158  14.068680
2009-01-23  11.619150   9.80893  162.188089  14.142682
2009-01-26  11.787468   9.97338  161.773501  14.496248
2009-01-27  11.930800   9.74122  165.574702  14.520916
2009-01-28  12.387098  10.52477  174.161139  14.833372
2009-01-29  12.229300   9.62514  171.488809  14.463359
2009-01-30  11.851901   9.18983  169.096191  14.060457
2009-02-02  12.033368   9.00603  170.115172  14.660698
2009-02-03  12.226670   9.45101  170.055239  15.211605
2009-02-04  12.301624   9.47036  171.328962  15.318497
2009-02-05  12.684283   9.12212  176.683613  15.655620
2009-02-06  13.112966   9.15114  185.454867  16.165414
2009-02-09  13.479845   9.32526  189.196135  15.984520
2009-02-10  12.864435   8.86093  179.076231  15.458279
2009-02-11  12.731622   8.72550  178.841472  15.795401
2009-02-12  13.053792   8.87060  181.343964  15.836515
2009-02-13  13.039327   8.82224  178.661643  15.696732
...               ...       ...         ...        ...
2012-04-23  75.177318  15.57434  298.502008  28.512527
2012-04-24  73.675617  15.65173  300.335186  28.334991
2012-04-25  80.213692  15.88390  304.555978  28.583544
2012-04-26  79.911244  15.99030  307.428105  28.503652
2012-04-27  79.293207  15.90324  307.183354  28.388252
2012-04-30  76.792114  15.83553  302.123410  28.423760
2012-05-01  76.548846  15.86455  301.913607  28.414881
2012-05-02  77.055108  15.64689  303.327209  28.228468
2012-05-03  76.508079  15.70010  305.205309  28.192961
2012-05-04  74.329161  15.29381  298.187334  27.500564
2012-05-07  74.885397  15.30348  303.472045  27.207627
2012-05-08  74.714449  15.19708  306.089446  27.074474
2012-05-09  74.845950  15.15838  304.271262  27.305273
2012-05-10  75.022151  15.04230  306.524016  27.287519
2012-05-11  74.521148  14.91654  302.313200  27.660348
2012-05-14  73.404729  14.93589  301.698816  27.234258
2012-05-15  72.740665  14.83916  305.250263  26.993008
2012-05-16  71.808347  14.52477  314.151389  26.716019
2012-05-17  69.709642  14.45222  311.214326  26.555187
2012-05-18  69.743829  14.25875  299.900615  26.153107
2012-05-21  73.807111  14.48124  306.748784  26.581993
2012-05-22  73.240361  14.58765  300.100412  26.590928
2012-05-23  75.027411  12.08221  304.426106  26.010146
2012-05-24  74.338367  12.04351  301.528978  25.974404
2012-05-25  73.939925  12.05319  295.470050  25.965469
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  75.252272  12.24666  296.873645  26.412225
2012-05-30  76.159610  12.14992  293.821674  26.215653
2012-05-31  75.970256  11.92743  290.140354  26.081627
2012-06-01  73.768977  11.67592  285.205295  25.420428

[868 rows x 4 columns]

In [106]:
pdata.ix[:,'6/1/2012',:]

            Open        High         Low       Close       Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900.0   73.768977
DELL   12.150000   12.300000   12.045000   12.070000   19397600.0   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700.0  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300.0   25.420428

In [107]:
pdata.ix['Adj Close','5/22/2012':,:]

                 AAPL      DELL        GOOG       MSFT
Date
2012-05-22  73.240361  14.58765  300.100412  26.590928
2012-05-23  75.027411  12.08221  304.426106  26.010146
2012-05-24  74.338367  12.04351  301.528978  25.974404
2012-05-25  73.939925  12.05319  295.470050  25.965469
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  75.252272  12.24666  296.873645  26.412225
2012-05-30  76.159610  12.14992  293.821674  26.215653
2012-05-31  75.970256  11.92743  290.140354  26.081627
2012-06-01  73.768977  11.67592  285.205295  25.420428

In [108]:
stacked = pdata.ix[:,'5/30/2012':,:].to_frame()
stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0

                   Adj Close
Date       minor
2012-05-30 AAPL    76.159610
           DELL    12.149920
           GOOG   293.821674
           MSFT    26.215653
2012-05-31 AAPL    75.970256
           DELL    11.927430
           GOOG   290.140354
           MSFT    26.081627
2012-06-01 AAPL    73.768977
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.420428

In [109]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT